Mathonix/AT32F423_LSM6DSV/src/app/main.c
volatile uint32_t protocol_reply_drops_uart, protocol_reply_drops_usb;

static int protocol_send_frame(protocol_source_t source, const uint8_t *frame, uint16_t len)
{
  int result = (source == PROTOCOL_SOURCE_UART) ?
               uart_control_enqueue(frame, len) : usb_cdc_write(frame, len);
  if(result != 0)
  {
    if(source == PROTOCOL_SOURCE_UART) protocol_reply_drops_uart++;
    else protocol_reply_drops_usb++;
  }
  return result;
}

static int protocol_reply_ack(protocol_source_t source, uint8_t seq,
                               uint8_t cmd_id, uint8_t status, uint16_t detail)
{
  uint8_t frame[AHRS_MAX_FRAME_LEN];
  uint16_t len = protocol_pack_ack(frame, sizeof(frame), seq, cmd_id, status, detail);
  return (len != 0U) ? protocol_send_frame(source, frame, len) : -1;
}

/* Keep the original four-byte maintenance commands for compatibility with
 * older scripts: AA 0C 01 0D = zero yaw, AA 00 00 0D = reset. */
static void legacy_command_feed(uint8_t byte, uint8_t buffer[4], uint8_t *index)
{
  if(*index == 0U)
  {
    if(byte == 0xAAU) buffer[(*index)++] = byte;
    return;
  }
  buffer[(*index)++] = byte;
  if(*index == 4U)
  {
    if(buffer[3] == 0x0DU)
    {
      if((buffer[1] == 0x0CU) && (buffer[2] == 0x01U))
        app_zero_yaw(vofa_pose_live.yaw);
      else if((buffer[1] == 0x00U) && (buffer[2] == 0x00U))
        app_request_reset(RESET_APPLICATION);
    }
    *index = 0U;
  }
}

static void protocol_frame_received(uint8_t msg_id, uint8_t seq,
                                    const uint8_t *payload, uint8_t len,
                                    void *user_data)
{
  const protocol_source_t source = (protocol_source_t)(uintptr_t)user_data;
  uint8_t frame[AHRS_MAX_FRAME_LEN];
  uint16_t frame_len;
  uint8_t status = AHRS_ACK_SUCCESS;

  switch(msg_id)
  {
    case AHRS_CMD_PING:
      protocol_reply_ack(source, seq, msg_id, AHRS_ACK_SUCCESS, 0U);
      break;
    case AHRS_CMD_ZERO_YAW:
      if(len != 0U) status = AHRS_ACK_INVALID_PARAM;
      else app_zero_yaw(vofa_pose_live.yaw);
      protocol_reply_ack(source, seq, msg_id, status, 0U);
      break;
    case AHRS_CMD_RECALIBRATE_GYRO:
      /* Runtime calibration is not allowed to block the 2 kHz sensor loop. */
      protocol_reply_ack(source, seq, msg_id, AHRS_ACK_EXEC_FAILED, 1U);
      break;
    case AHRS_CMD_SET_STREAM_MODE:
      if((len != 1U) || (payload == NULL) ||
         (payload[0] > STREAM_MODE_VOFA_6CH))
      {
        status = AHRS_ACK_INVALID_PARAM;
      }
      else
      {
        app_stream_mode = (stream_mode_t)payload[0];
      }
      protocol_reply_ack(source, seq, msg_id, status, (uint16_t)app_stream_mode);
      break;
    case AHRS_CMD_SET_OUTPUT_HZ:
      /* 2 kHz fusion permits only exact integer divisors. This command is
       * runtime-only; flash persistence is deliberately not implied. */
      if((payload == NULL) || (len != 2U))
      {
        status = AHRS_ACK_INVALID_PARAM;
      }
      else
      {
        uint16_t hz = (uint16_t)payload[0] | ((uint16_t)payload[1] << 8);
        if((hz == 0U) || (hz > APP_FUSION_HZ) || ((APP_FUSION_HZ % hz) != 0U))
        {
          status = AHRS_ACK_INVALID_PARAM;
        }
        else
        {
          app_output_hz = hz;
          app_output_div = (uint16_t)(APP_FUSION_HZ / hz);
        }
      }
      protocol_reply_ack(source, seq, msg_id, status, app_output_hz);
      break;
    case AHRS_CMD_QUERY_STATUS:
      if(len != 0U)
      {
        protocol_reply_ack(source, seq, msg_id, AHRS_ACK_INVALID_PARAM, 0U);
        break;
      }
      frame_len = protocol_pack_system_info(frame, sizeof(frame), seq, APP_FUSION_HZ,
                                             app_output_hz, app_output_div,
                                             imu_temp_live.temperature_c,
                                             (uint8_t)app_stream_mode,
                                             (uint8_t)((APP_CAN_ENABLE != 0U) && (can_test_live.init_ok != 0U)));
      if(frame_len != 0U) protocol_send_frame(source, frame, frame_len);
      break;
    case AHRS_CMD_ENTER_SETTINGS:
      if(len != 0U) status = AHRS_ACK_INVALID_PARAM;
      else app_settings_mode = 1U;
      protocol_reply_ack(source, seq, msg_id, status, 0U);
      break;
    case AHRS_CMD_EXIT_SETTINGS:
      if(len != 0U) status = AHRS_ACK_INVALID_PARAM;
      else app_settings_mode = 0U;
      protocol_reply_ack(source, seq, msg_id, status, app_settings_dirty);
      break;
    case AHRS_CMD_SET_FUSION_MODE:
      /* Settings are deliberately staged in flash. The running VQF mode is
       * never changed in-place; reboot applies the selected mode. */
      if((app_settings_mode == 0U) || (len < 1U) || (len > 2U) ||
         (payload == NULL) || (payload[0] > FUSION_MODE_9AXIS_RELATIVE) ||
         ((len == 2U) && (payload[1] > 1U)))
      {
        status = (app_settings_mode == 0U) ? AHRS_ACK_EXEC_FAILED : AHRS_ACK_INVALID_PARAM;
      }
      else if(app_save_settings((fusion_mode_t)payload[0],
                                can_test_get_node_id()) != 0)
      {
        status = AHRS_ACK_EXEC_FAILED;
      }
      else
      {
        app_settings_dirty = 1U;
      }
      /* Do not reboot if the success reply could not enter the TX queue. */
      if(protocol_reply_ack(source, seq, msg_id, status,
                            (payload != NULL && len != 0U) ? payload[0] : 0U) == 0 &&
         status == AHRS_ACK_SUCCESS && len == 2U && payload[1] != 0U)
        app_request_reset(RESET_APPLICATION);
      break;
    case AHRS_CMD_SET_CAN_NODE_ID:
      if((app_settings_mode == 0U) || (payload == NULL) || (len != 2U))
      {
        status = (app_settings_mode == 0U) ? AHRS_ACK_EXEC_FAILED : AHRS_ACK_INVALID_PARAM;
      }
      else
      {
        uint16_t node_id = (uint16_t)payload[0] | ((uint16_t)payload[1] << 8);
        if((node_id > 0x7FFU) ||
           (can_test_set_node_id(node_id) != 0) ||
           (app_save_settings(app_fusion_mode, node_id) != 0))
        {
          status = (node_id > 0x7FFU) ? AHRS_ACK_INVALID_PARAM : AHRS_ACK_EXEC_FAILED;
        }
        else
        {
          app_settings_dirty = 1U;
        }
      }
      protocol_reply_ack(source, seq, msg_id, status,
                         (uint16_t)can_test_get_node_id());
      break;
    case AHRS_CMD_START_GYRO_CAL_60S:
      /* Runtime calibration is not yet a blocking operation. Reuse the
       * existing safe command response until its non-blocking state machine
       * is enabled, instead of silently pretending that it completed. */
      protocol_reply_ack(source, seq, msg_id, AHRS_ACK_EXEC_FAILED, 0x0601U);
      break;
    case AHRS_CMD_START_ACC_6FACE_CAL:
#if !APP_ACC_CAL_ENABLE
      (void)payload;
      (void)len;
      protocol_reply_ack(source, seq, msg_id, AHRS_ACK_EXEC_FAILED, 0x0600U);
#else
      if((app_settings_mode == 0U) || (len != 0U))
      {
        status = (app_settings_mode == 0U) ? AHRS_ACK_EXEC_FAILED : AHRS_ACK_INVALID_PARAM;
        protocol_reply_ack(source, seq, msg_id, status, 0x0602U);
      }
      else if(acc_cal_rt.active != 0U)
      {
        protocol_reply_ack(source, seq, msg_id, AHRS_ACK_EXEC_FAILED, 0x0604U);
      }
      else
      {
        memset(&acc_cal_rt, 0, sizeof(acc_cal_rt));
        acc_cal_rt.active = 1U; acc_cal_rt.face = 0U;
        acc_cal_rt.source = (uint8_t)source; acc_cal_rt.seq = seq;
        acc_cal_rt.start_ms = millis(); acc_cal_rt.face_start_ms = acc_cal_rt.start_ms;
        acc_cal_status_live.status = ACC_CAL_STATUS_RUNNING;
        acc_cal_status_live.face = 1U; acc_cal_status_live.face_mask = 0U;
        protocol_reply_ack(source, seq, msg_id, AHRS_ACK_SUCCESS, 0x0100U);
      }
#endif
      break;
    case AHRS_CMD_SYSTEM_RESET:
    case AHRS_CMD_ENTER_BOOTLOADER:
      if(len != 0U)
      {
        protocol_reply_ack(source, seq, msg_id, AHRS_ACK_INVALID_PARAM, 0U);
      }
      else
      {
        if(protocol_reply_ack(source, seq, msg_id, AHRS_ACK_SUCCESS, 0U) == 0)
          app_request_reset((msg_id == AHRS_CMD_ENTER_BOOTLOADER) ?
                             RESET_BOOTLOADER : RESET_APPLICATION);
      }
      break;
    default:
      protocol_reply_ack(source, seq, msg_id, AHRS_ACK_UNKNOWN_CMD, 0U);
      break;
  }
}


#if APP_ACC_CAL_ENABLE
static int acc_cal_detect_face(const float a[3], const float gyr_dps[3])
{
  float n = sqrtf(a[0]*a[0] + a[1]*a[1] + a[2]*a[2]);
  float ag[3] = {fabsf(a[0]),fabsf(a[1]),fabsf(a[2])};
  uint32_t k; int axis=0; float best=ag[0];
  if(n < (1.0f-APP_ACC_CAL_NORM_TOL_G) || n > (1.0f+APP_ACC_CAL_NORM_TOL_G)) return -1;
  if(fabsf(gyr_dps[0]) > APP_ACC_CAL_GYR_REST_DPS || fabsf(gyr_dps[1]) > APP_ACC_CAL_GYR_REST_DPS || fabsf(gyr_dps[2]) > APP_ACC_CAL_GYR_REST_DPS) return -1;
  for(k=1U;k<3U;k++) if(ag[k]>best){best=ag[k];axis=(int)k;}
  if(best < APP_ACC_CAL_DOMINANT_MIN_G) return -1;
  for(k=0U;k<3U;k++) if((int)k!=axis && ag[k]>APP_ACC_CAL_OTHER_MAX_G) return -1;
  return axis*2 + ((a[axis] >= 0.0f) ? 1 : 0);
}

