Mathonix/AT32F423_LSM6DSV/src/app/main.c
static void acc_cal_finish(uint8_t ok, uint16_t detail)
{
  uint8_t source=acc_cal_rt.source; uint8_t seq=acc_cal_rt.seq;
  acc_cal_rt.active=0U;
  acc_cal_status_live.status = ok ? ACC_CAL_STATUS_DONE : ACC_CAL_STATUS_FAILED;
  acc_cal_status_live.face = ok ? 6U : acc_cal_rt.face+1U;
  if(ok) { acc_cal_status_live.face_mask=0x3FU; acc_cal_status_live.bias_g[0]=acc_calibration_active.bias_g[0]; acc_cal_status_live.bias_g[1]=acc_calibration_active.bias_g[1]; acc_cal_status_live.bias_g[2]=acc_calibration_active.bias_g[2]; }
  protocol_reply_ack((protocol_source_t)source, seq, AHRS_CMD_START_ACC_6FACE_CAL, ok ? AHRS_ACK_SUCCESS : AHRS_ACK_EXEC_FAILED, detail);
}

static void acc_calibration_sample_task(uint32_t now_ms, const float raw_g[3], const float gyr_dps[3])
{
  int dir; uint8_t axis, sign; uint32_t i;
  if(acc_cal_rt.active==0U) return;
  acc_cal_status_live.millis=now_ms; acc_cal_status_live.seq++; acc_cal_status_live.face=acc_cal_rt.face+1U;
  acc_cal_status_live.detected_face=0U; acc_cal_status_live.sample_count=(uint16_t)(acc_cal_rt.samples>65535U?65535U:acc_cal_rt.samples);
  if((uint32_t)(now_ms - ((acc_cal_rt.face_start_ms != 0U) ? acc_cal_rt.face_start_ms : acc_cal_rt.start_ms)) >
     (uint32_t)(APP_ACC_CAL_FACE_TIMEOUT_S * 1000.0f)) { acc_cal_finish(0U,0x0603U); return; }
  dir=acc_cal_detect_face(raw_g,gyr_dps);
  if(dir<0 || (acc_cal_rt.face_mask & (uint8_t)(1U<<dir))!=0U) { acc_cal_rt.stable_ms=0U; acc_cal_rt.collect_ms=0U; acc_cal_rt.samples=0U; return; }
  acc_cal_status_live.detected_face=(uint8_t)(dir+1);
  if(acc_cal_rt.candidate != (uint8_t)(dir+1)) { acc_cal_rt.candidate=(uint8_t)(dir+1); acc_cal_rt.stable_ms=now_ms; acc_cal_rt.collect_ms=0U; acc_cal_rt.samples=0U; for(i=0;i<3;i++) acc_cal_rt.sum[i]=0.0f; return; }
  if((uint32_t)(now_ms-acc_cal_rt.stable_ms) < APP_ACC_CAL_STABLE_MS) return;
  if(acc_cal_rt.collect_ms==0U) acc_cal_rt.collect_ms=now_ms;
  for(i=0;i<3;i++)
    acc_cal_rt.sum[i]+=raw_g[i];
  acc_cal_rt.samples++;
  if((uint32_t)(now_ms-acc_cal_rt.collect_ms) < (uint32_t)(APP_ACC_CAL_FACE_SECONDS * 1000.0f)) return;
  if(acc_cal_rt.samples < 50U) { acc_cal_finish(0U,0x0605U); return; }
  axis=(uint8_t)(dir/2); sign=(uint8_t)(dir&1U);
  for(i=0;i<3;i++) acc_cal_rt.face_mean[dir][i]=acc_cal_rt.sum[i]/(float)acc_cal_rt.samples;
  acc_cal_rt.face_mask |= (uint8_t)(1U<<dir); acc_cal_rt.face++; acc_cal_rt.face_start_ms=now_ms; acc_cal_rt.candidate=0U; acc_cal_rt.stable_ms=0U; acc_cal_rt.collect_ms=0U; acc_cal_rt.samples=0U;
  (void)axis; (void)sign;
  if(acc_cal_rt.face>=6U)
  {
    acc_calibration_t cal; float pos,neg;
    for(axis=0U;axis<3U;axis++) { pos=acc_cal_rt.face_mean[axis*2+1][axis]; neg=acc_cal_rt.face_mean[axis*2][axis]; cal.bias_g[axis]=(pos+neg)*0.5f; cal.scale[axis]=2.0f/(pos-neg); if(cal.scale[axis]<0.5f||cal.scale[axis]>1.5f) { acc_cal_finish(0U,0x0606U); return; } }
    cal.valid=1U; if(app_save_acc_calibration(&cal)!=0) { acc_cal_finish(0U,0x0607U); return; }
    acc_cal_status_live.bias_g[0]=cal.bias_g[0]; acc_cal_status_live.bias_g[1]=cal.bias_g[1]; acc_cal_status_live.bias_g[2]=cal.bias_g[2];
    acc_cal_status_live.scale[0]=cal.scale[0]; acc_cal_status_live.scale[1]=cal.scale[1]; acc_cal_status_live.scale[2]=cal.scale[2]; acc_cal_finish(1U,0U);
  }
}
#endif /* APP_ACC_CAL_ENABLE */

static float temp_lpf_c;
static float temp_lpf_alpha;
static uint8_t temp_lpf_init;
static uint8_t temp_lpf_alpha_init;

/* LSM6DSV temperature is specified as 25 degC + raw/256.  The raw value is
 * kept in imu_temp_live; a slow LPF is used only for the optional gyro
 * temperature compensation so temperature ADC noise is not turned into gyro
 * noise. */
static float update_temperature(int16_t raw_temp)
{
  const float raw_c = APP_GYR_TEMP_REF_C + ((float)raw_temp / 256.0f);

  if(!temp_lpf_alpha_init)
  {
    if(APP_GYR_TEMP_LPF_HZ > 0.0f)
      temp_lpf_alpha = 1.0f - expf(-6.28318530718f *
                                    APP_GYR_TEMP_LPF_HZ / FUSION_HZ);
    else
      temp_lpf_alpha = 1.0f;
    if(temp_lpf_alpha < 0.0f) temp_lpf_alpha = 0.0f;
    if(temp_lpf_alpha > 1.0f) temp_lpf_alpha = 1.0f;
    temp_lpf_alpha_init = 1U;
  }

  if(!temp_lpf_init)
  {
    temp_lpf_c = raw_c;
    temp_lpf_init = 1U;
  }
  else
  {
    temp_lpf_c += temp_lpf_alpha * (raw_c - temp_lpf_c);
  }

  imu_temp_live.seq++;
  __DMB();
  imu_temp_live.raw_temp = raw_temp;
  imu_temp_live.temperature_c = raw_c;
  imu_temp_live.millis = millis();
  __DMB();
  imu_temp_live.seq++;
  return temp_lpf_c;
}

static float gyro_dps_from_raw(unsigned axis, int16_t raw, float temp_c)
{
  float dps = (float)raw * GYR_DPS_PER_LSB;

#if APP_GYR_TEMP_COMP_ENABLE
  float coeff = 0.0f;
  if(axis == 0U) coeff = APP_GYR_TEMP_COEFF_X_DPS_PER_C;
  else if(axis == 1U) coeff = APP_GYR_TEMP_COEFF_Y_DPS_PER_C;
  else if(axis == 2U) coeff = APP_GYR_TEMP_COEFF_Z_DPS_PER_C;
  dps -= coeff * (temp_c - APP_GYR_TEMP_REF_C);
#else
  (void)axis;
  (void)temp_c;
#endif
  return dps;
}

static void sort_float(float *values, uint32_t n)
{
  uint32_t i;

  for(i = 1U; i < n; ++i)
  {
    const float value = values[i];
    uint32_t j = i;
    while((j > 0U) && (values[j - 1U] > value))
    {
      values[j] = values[j - 1U];
      --j;
    }
    values[j] = value;
  }
}

static float trimmed_mean(float *values, uint32_t n)
{
  uint32_t trim;
  uint32_t first;
  uint32_t last;
  uint32_t i;
  float sum = 0.0f;

  if(n == 0U) return 0.0f;
  sort_float(values, n);
  trim = (n * CAL_TRIM_PERCENT) / 100U;
  if((trim * 2U) >= n) trim = 0U;
  first = trim;
  last = n - trim;
  for(i = first; i < last; ++i) sum += values[i];
  return sum / (float)(last - first);
}

static void vofa_send_justfloat(float late)
{
  static uint8_t filter_init;
#if APP_VOFA_REST_HOLD_ENABLE
  static uint8_t rest_hold;
  static float rest_yaw;
  static float rest_pitch;
  static float rest_roll;
#endif
  static float yaw_kf;
  static float yaw_kf_var;
  static float rate_norm_lpf;
  static float innovation_var;
  static float yaw_kf_r_scale = 1.0f;
  static float motion_on_time;
  static float motion_off_time;
  static uint32_t yaw_sync_div;
  static uint32_t kf_last_cy;
  static uint8_t kf_clock_init;
  static uint8_t rate_lpf_init;
  static uint8_t motion_active;
  const float nominal_dt = ((float)app_output_div / FUSION_HZ);
  float dt = nominal_dt;
  float output_yaw;
  float output_pitch;
  float output_roll;
    /* Use the real output interval when it is sane. This prevents a delayed
     * UART/I2C iteration from making the output filter use an incorrect gyro
     * integration interval. */
    {
      uint32_t now_cy = dwt_cycles();
      if((kf_clock_init != 0U) && (system_core_clock != 0U))
      {
        float measured_dt = (float)(now_cy - kf_last_cy) /
                            (float)system_core_clock;
        if((measured_dt >= 0.00025f) && (measured_dt <= 0.005f))
          dt = measured_dt;
      }
      kf_last_cy = now_cy;
      kf_clock_init = 1U;
    }

  /* Output-only adaptive 1D angle Kalman filter. VQF continues to calculate
    * its normal yaw; this filter only affects the VOFA/DAP output pose ABI.
    * The rate hysteresis, innovation gate and adaptive R below prevent a
    * single noisy sample or a threshold crossing from moving the output. */
  {
    /* Use the temperature-compensated, low-pass filtered gyro residual for
     * the output-only yaw KF. VQF itself continues to run independently. */
    float yaw_rate = vqf_live.corrected_z;
    float gx = vqf_live.gx - vqf_live.bias_x;
    float gy = vqf_live.gy - vqf_live.bias_y;
    float gz = yaw_rate;
    float rate_norm = sqrtf(gx * gx + gy * gy + gz * gz);
    float rate_alpha;
    float motion_den = APP_VOFA_YAW_KF_MOTION_FULL_DPS -
                       APP_VOFA_YAW_KF_MOTION_START_DPS;
    float motion;
    float yaw_q;
    float yaw_r_base;
    float yaw_r;
    float acc_norm;
    float acc_disturbance;
    float p_pred;
    float yaw_pred;
    float innovation;
    float p_floor = 1.0e-9f;

    /* A bad sample must not poison the state or covariance. */
    if(!(rate_norm >= 0.0f)) rate_norm = 0.0f;

    /* Filter the rate used for motion classification. The gyro itself is
     * still used for prediction once motion has been confirmed. */
    if(APP_VOFA_YAW_KF_RATE_LPF_HZ > 0.0f)
      rate_alpha = 1.0f - expf(-6.28318530718f *
                               APP_VOFA_YAW_KF_RATE_LPF_HZ * dt);
    else
      rate_alpha = 1.0f;
    if(rate_alpha < 0.0f) rate_alpha = 0.0f;
    if(rate_alpha > 1.0f) rate_alpha = 1.0f;
    if(!rate_lpf_init)
    {
      rate_norm_lpf = rate_norm;
      rate_lpf_init = 1U;
    }
    else
    {
      rate_norm_lpf += rate_alpha * (rate_norm - rate_norm_lpf);
    }

