Mathonix/AT32F423_LSM6DSV/src/app/main.c
  vofa_pose_live.seq++;
  __DMB();
  vofa_pose_live.yaw = output_yaw;
  vofa_pose_live.pitch = output_pitch;
  vofa_pose_live.roll = output_roll;
  vofa_pose_live.temperature_c = imu_temp_live.temperature_c;
  vofa_pose_live.millis = millis();
  __DMB();
  vofa_pose_live.seq++;

  /* Keep a compact, sequence-locked copy for high-rate DAPLink capture. */
  yaw_sync_div++;
  if(yaw_sync_div >= YAW_KF_SYNC_DIV)
  {
    yaw_sync_div = 0U;
    yaw_kf_sync_live.seq++;
    __DMB();
    yaw_kf_sync_live.millis = vofa_pose_live.millis;
    yaw_kf_sync_live.vqf_yaw = vqf_live.yaw;
    yaw_kf_sync_live.kf_yaw = output_yaw;
    yaw_kf_sync_live.gz = vqf_live.gz;
    yaw_kf_sync_live.bias_z = vqf_live.bias_z;
    yaw_kf_sync_live.rest_detected = vqf_live.rest_detected;
    yaw_kf_sync_live.mag_updates = vqf_live.mag_updates;
    yaw_kf_sync_live.temperature_c = vqf_live.temperature_c;
    yaw_kf_sync_live.gyr_lpf_z = vqf_live.gyr_lpf_z;
    yaw_kf_sync_live.corrected_z = vqf_live.corrected_z;
    __DMB();
    yaw_kf_sync_live.seq++;
  }

  /* Stream mode is now applied to the actual output path. The default is
   * unchanged: JustFloat yaw/pitch/roll on both USB CDC and USART4. */
  {
    uint16_t tx_len = 0U;
    uint8_t *tx = vofa_dma[vofa_sel];
    static const uint8_t tail[4] = {0x00U, 0x00U, 0x80U, 0x7FU};
    float ch[VOFA_MAX_CH];

    if(app_stream_mode == STREAM_MODE_VOFA_3CH ||
       app_stream_mode == STREAM_MODE_VOFA_6CH)
    {
      uint8_t n = (app_stream_mode == STREAM_MODE_VOFA_6CH) ? 6U : 3U;
      ch[0] = output_yaw;
      ch[1] = output_pitch;
      ch[2] = output_roll;
      if(n == 6U)
      {
        ch[3] = vqf_live.gz;
        ch[4] = vqf_live.az;
        ch[5] = imu_temp_live.temperature_c;
      }
      memcpy(tx, ch, (uint16_t)n * 4U);
      memcpy(tx + (uint16_t)n * 4U, tail, 4U);
      tx_len = (uint16_t)n * 4U + 4U;
    }
    else if(app_stream_mode == STREAM_MODE_BIN_ATT)
    {
      uint8_t flags = (uint8_t)(vqf_live.rest_detected ? AHRS_FLAG_REST_DETECTED : 0U);
      tx_len = protocol_pack_attitude(tx, VOFA_MAX_BYTES, app_stream_seq++, output_roll,
                                      output_pitch, output_yaw, flags,
                                      (uint16_t)millis());
    }
    else if(app_stream_mode == STREAM_MODE_BIN_COMPACT)
    {
      uint8_t flags = (uint8_t)(vqf_live.rest_detected ? AHRS_FLAG_REST_DETECTED : 0U);
      tx_len = protocol_pack_compact(tx, VOFA_MAX_BYTES, app_stream_seq++, output_roll,
                                     output_pitch, output_yaw, vqf_live.gz,
                                     flags, (uint16_t)millis());
    }
    else if(app_stream_mode == STREAM_MODE_BIN_IMU)
    {
      tx_len = protocol_pack_imu(tx, VOFA_MAX_BYTES, app_stream_seq++, vqf_live.gx,
                                 vqf_live.gy, vqf_live.gz, vqf_live.ax,
                                 vqf_live.ay, vqf_live.az,
                                 imu_temp_live.temperature_c,
                                 (uint16_t)millis());
    }

    if(tx_len != 0U)
    {
      (void)usb_cdc_write(tx, tx_len);
      if(uart_dma_send(tx, tx_len) == 0)
        vofa_sel ^= 1U;
      else
        vofa_late++;
    }
  }

#if APP_CAN_ENABLE
  can_test_update_data(output_roll, output_pitch, output_yaw,
                       vqf_live.gx, vqf_live.gy, vqf_live.gz,
                       vqf_live.ax, vqf_live.ay, vqf_live.az,
                       vqf_live.qw, vqf_live.qx, vqf_live.qy, vqf_live.qz,
                       imu_temp_live.temperature_c,
                       (uint8_t)vqf_live.rest_detected);
#endif
}

static void live_init(void)
{
  vqf_live.magic = VQF_LIVE_MAGIC;
  vqf_live.seq = 0;
  vqf_live.init_err = 0;
  vqf_live.whoami = 0;
  vqf_live.clk_hz = system_core_clock;
  vqf_live.millis = 0;
  vqf_live.fusion_hz = 0;
  vqf_live.out_hz = 0;
  vqf_live.fusion_n = 0;
  vqf_live.skip_n = 0;
  vqf_live.vqf_us = 0;
  vqf_live.bias_x = 0.0f;
  vqf_live.bias_y = 0.0f;
  vqf_live.bias_z = 0.0f;
  vqf_live.rest_time = 0.0f;
  vqf_live.tau_acc = 0.0f;
  vqf_live.rest_detected = 0U;
  vqf_live.mag_err = -1;
  vqf_live.mag_addr = 0U;
  vqf_live.mag_updates = 0U;
  vqf_live.mag_ready = 0U;
  vqf_live.temperature_c = APP_GYR_TEMP_REF_C;
  vqf_live.gyr_lpf_z = 0.0f;
  vqf_live.corrected_z = 0.0f;

  memset((void *)&vqf_tune_live, 0, sizeof(vqf_tune_live));
  vqf_tune_live.magic = VQF_TUNE_MAGIC;
}

static void live_whoami(void)
{
  uint8_t who = 0xFFU;
  (void)lsm6dsv_read_reg(LSM6DSV_WHO_AM_I_REG, &who);
  vqf_live.whoami = who;
}

/* Keep the application observable and recoverable when the IMU is absent or
 * SPI initialization fails. The old implementation stopped forever here,
 * leaving the last SRAM telemetry snapshot looking like a valid zero-drift
 * result and preventing a later sensor reconnection from recovering. */
static int sensor_init_retry_loop(int initial_err)
{
  uint32_t next_retry_ms = 0U;
  uint32_t last_led_ms = 0U;
  int err = initial_err;

  vqf_live.init_err = err;
  for(;;)
  {
    const uint32_t now = millis();
    live_whoami();
    vqf_live.init_err = err;
    vqf_live.millis = now;
    vqf_live.fusion_hz = 0U;
    vqf_live.out_hz = 0U;
    vqf_live.seq++;
    /* Publish a changing sequence in the exact live block used by DAPLink
     * tools, so stale SRAM is never mistaken for a valid zero-drift record. */
    vqf_tune_live.millis = now;
    vqf_tune_live.fusion_hz = 0U;
    vqf_tune_live.seq++;

    /* Keep the host link serviced so the failure remains diagnosable. */
    usb_cdc_task();
    if((uint32_t)(now - last_led_ms) >= 200U)
    {
      last_led_ms = now;
      ws2812_show_error(1U);
      led_toggle();
    }

    if((int32_t)(now - next_retry_ms) >= 0)
    {
      (void)lsm6dsv_spi_recover();
      err = lsm6dsv_init_2khz();
      live_whoami();
      if(err == 0)
      {
        vqf_live.init_err = 0;
        return 0;
      }
      next_retry_ms = millis() + 500U;
    }
    delay_ms(10U);
  }
}
#define APP_BOOT_REQUEST_ADDR 0x2000BFF0U
#define APP_BOOT_REQUEST_MAGIC 0x424F4F54U
static void app_perform_reset(reset_request_t request)
{
  if(request == RESET_BOOTLOADER)
  {
    *((volatile uint32_t *)APP_BOOT_REQUEST_ADDR) = APP_BOOT_REQUEST_MAGIC;
    __DMB();
  }
  nvic_system_reset();
}

int main(void)
{
  SCB->VTOR = 0x08008000U;
  lsm6dsv_raw_t raw;
  float gyr[3];
  float acc[3];
  float mag[3] = {0.0f, 0.0f, 0.0f};
  float q[4];
  float roll;
  float pitch;
  float yaw;
  uint32_t fusion_n = 0; /* monotonic sample sequence; never reset each second */
  uint32_t window_samples = 0;
  uint32_t out_n = 0;
  uint32_t skip_n = 0;
  uint32_t last_ms;
  uint32_t fusion_hz = 0;
  int err;
  int mag_err;
  uint8_t mag_ok;
  uint8_t mag_pending;
  uint32_t mag_start_n;
  uint32_t mag_updates;
  uint32_t mag_read_n;
  uint32_t t0;
  uint32_t vqf_us;
  uint32_t i;
  float temp_c = APP_GYR_TEMP_REF_C;
  uint8_t bias_fallback = 0U;
  uint8_t bias_no_history = 0U;
  uint8_t bias_history_write_error = 0U;
  uint8_t quick_bias_active = 0U;
  uint8_t quick_bias_saved = 0U;
  uint32_t quick_rest_ms = 0U;
  uint32_t quick_save_elapsed_ms = 0U;
  uint32_t quick_samples = 0U;
  float quick_bias[3] = {0.0f, 0.0f, 0.0f};
  float quick_bias_initial[3] = {0.0f, 0.0f, 0.0f};
  float quick_bias_sum[3] = {0.0f, 0.0f, 0.0f};
  float quick_bias_temp_c = APP_GYR_TEMP_REF_C;
#if APP_SFLP_BIAS_ENABLE
  float sflp_bias_dps[3] = {0.0f, 0.0f, 0.0f};
  uint8_t sflp_bias_ok = 0U;
#endif
  float gyr_lpf[3] = {0.0f, 0.0f, 0.0f};
  uint8_t gyr_lpf_init = 0U;
  const float gyr_lpf_alpha = 1.0f - expf(-6.28318530718f * GYR_LPF_CUTOFF_HZ / FUSION_HZ);

  system_clock_config();
  bsp_init();
  ws2812_init();
  live_init();
  lsm6dsv_spi_init();
#if APP_ACC_CAL_ENABLE
  acc_calibration_load();
#endif
#if APP_CAN_ENABLE
  can_test_init();
#endif
  usb_cdc_init();
  protocol_parser_init(&uart_protocol_parser, protocol_frame_received,
                       (void *)(uintptr_t)PROTOCOL_SOURCE_UART);
  protocol_parser_init(&usb_protocol_parser, protocol_frame_received,
                       (void *)(uintptr_t)PROTOCOL_SOURCE_USB);
  {
    uint16_t stored_can_id = APP_CAN_DEFAULT_CAN_ID;
    (void)fusion_settings_load_ex(&app_fusion_mode, &stored_can_id);
#if !APP_MAG_FUSION_ENABLE
    /* A six-axis image must not inherit a previously stored nine-axis mode. */
    app_fusion_mode = FUSION_MODE_6AXIS;
#endif
    (void)can_test_set_node_id(stored_can_id);
  }
  app_relative_yaw_enabled = (app_fusion_mode == FUSION_MODE_9AXIS_RELATIVE) ? 1U : 0U;
  delay_ms(20);

#if APP_SFLP_BIAS_ENABLE
  if(lsm6dsv_read_sflp_gbias(sflp_bias_dps, APP_SFLP_BIAS_SETTLE_MS) == 0)
  {
    sflp_bias_ok = 1U;
  }
#endif
  live_whoami();
  err = lsm6dsv_init_2khz();
  live_whoami();
  if(err != 0)
  {
    (void)sensor_init_retry_loop(err);
  }

  mag_err = ist8310_init();
  mag_ok = ((mag_err == 0) && (app_fusion_mode != FUSION_MODE_6AXIS)) ? 1U : 0U;
  mag_pending = 0U;
  mag_start_n = 0U;
  mag_updates = 0U;
  mag_read_n = 0U;
  vqf_live.mag_err = mag_err;
  vqf_live.mag_addr = ist8310_get_addr();

  vqf_init(1.0f / FUSION_HZ, 1.0f / FUSION_HZ);
  {
    float startup_acc[3] = {0.0f, 0.0f, G_TO_MS2};
    float history_latest[3] = {0.0f, 0.0f, 0.0f};
    float history_average[3] = {0.0f, 0.0f, 0.0f};
    float history_nearest[3] = {0.0f, 0.0f, 0.0f};
    float nearest_temp_c = 0.0f;
    uint32_t history_count = 0U;
    uint8_t nearest_valid = 0U;
    uint8_t history_corrupt = 0U;
    float gyr_bias[3] = {0.0f, 0.0f, 0.0f};
    float acc_avg[3] = {0.0f, 0.0f, G_TO_MS2};
    lsm6dsv_raw_t startup_raw;
    int history_valid;

    /* Read one sample only to obtain an immediate gravity vector and current
     * temperature. There is deliberately no startup calibration loop here. */
    (void)lsm6dsv_wait_sample(2000U);
    if(lsm6dsv_read_raw(&startup_raw) == 0)
    {
      temp_c = update_temperature(startup_raw.temp_raw);
      for(i = 0U; i < 3U; ++i)
      {
#if APP_ACC_CAL_ENABLE
        startup_acc[i] = acc_calibrate_g(i, (float)startup_raw.acc[i] * ACC_G_PER_LSB) * G_TO_MS2;
#else
        startup_acc[i] = (float)startup_raw.acc[i] * ACC_G_PER_LSB * G_TO_MS2;
#endif
      }
    }
#if APP_GYR_FAST_START_ENABLE
    history_valid = gyro_bias_history_load_for_temp(
        history_latest, history_average, history_nearest, temp_c,
        CAL_BIAS_TEMP_WINDOW_C, &nearest_temp_c, &nearest_valid,
        &history_count, &history_corrupt);

    if((history_valid != 0) && (nearest_valid != 0U))
    {
      for(i = 0U; i < 3U; ++i) quick_bias[i] = history_nearest[i];
      quick_bias_temp_c = nearest_temp_c;
    }
    else
    {
      /* No temperature-matched history: use the configured fixed defaults.
       * This is also the explicit missing-history indication for the LED. */
      quick_bias[0] = APP_GYR_DEFAULT_BIAS_X_DPS * DEG2RAD;
      quick_bias[1] = APP_GYR_DEFAULT_BIAS_Y_DPS * DEG2RAD;
      quick_bias[2] = APP_GYR_DEFAULT_BIAS_Z_DPS * DEG2RAD;
      quick_bias_temp_c = temp_c;
      bias_no_history = 1U;
      bias_fallback = 1U;
    }
    for(i = 0U; i < 3U; ++i)
    {
      quick_bias_initial[i] = quick_bias[i];
      gyr_bias[i] = quick_bias[i];
      acc_avg[i] = startup_acc[i];
    }
    quick_bias_active = 1U;
    (void)history_average;
    (void)history_count;
    (void)history_corrupt;
#else
    /* Fast startup is deliberately disabled in normal builds. Keep the
     * immediate sensor seed deterministic; a debug build can enable the
     * history/background correction path with FAST_START=1. */
    quick_bias[0] = APP_GYR_DEFAULT_BIAS_X_DPS * DEG2RAD;
    quick_bias[1] = APP_GYR_DEFAULT_BIAS_Y_DPS * DEG2RAD;
    quick_bias[2] = APP_GYR_DEFAULT_BIAS_Z_DPS * DEG2RAD;
    for(i = 0U; i < 3U; ++i)
    {
      gyr_bias[i] = quick_bias[i];
      acc_avg[i] = startup_acc[i];
    }
    quick_bias_active = 0U;
    (void)history_valid;
    (void)history_average;
    (void)history_count;
    (void)history_corrupt;
#endif
    vqf_prime_rest(acc_avg, gyr_bias);
  }
  vqf_live.seq = 2;
  last_ms = millis();
  /* In 6-axis mode a missing/disabled magnetometer is expected; do not
   * replace the normal status LED with a permanent amber error. */
  if((!mag_ok) && (app_fusion_mode != FUSION_MODE_6AXIS))
    ws2812_show_error(2U);

  {
    uint32_t last_sample_cy = dwt_cycles();
    uint32_t err_streak = 0U;

  while(1)
  {
    uint32_t now_cy;
    uint32_t dt_cy;

    if(lsm6dsv_wait_sample(2000U) != 0)
    {
      skip_n++;
      err_streak++;
      goto recover_or_continue;
    }
    if(lsm6dsv_read_raw(&raw) != 0)
    {
      skip_n++;
      err_streak++;
      goto recover_or_continue;
    }

