Mathonix/AT32F423_LSM6DSV/src/app/main.c
    /* Temperature is part of the same 14-byte SPI burst as gyro/accel.
     * temp_c is the filtered value used by the optional gyro compensation;
     * imu_temp_live.temperature_c remains the raw converted telemetry value. */
    temp_c = update_temperature(raw.temp_raw);

    now_cy = dwt_cycles();
    dt_cy = now_cy - last_sample_cy;
    last_sample_cy = now_cy;
    if((fusion_n > 0U) && (dt_cy > DROP_DT_CYCLES))
    {
      skip_n++;
      err_streak = 0U;
      goto service_tasks;
    }
    err_streak = 0U;

    for(i = 0; i < 3U; i++)
    {
      gyr[i] = gyro_dps_from_raw(i, raw.gyr[i], temp_c) * DEG2RAD;
#if APP_ACC_CAL_ENABLE
      acc[i] = acc_calibrate_g(i, (float)raw.acc[i] * ACC_G_PER_LSB) * G_TO_MS2;
#else
      acc[i] = (float)raw.acc[i] * ACC_G_PER_LSB * G_TO_MS2;
#endif
    }

#if APP_ACC_CAL_ENABLE
    { float raw_acc_g[3] = { (float)raw.acc[0] * ACC_G_PER_LSB, (float)raw.acc[1] * ACC_G_PER_LSB, (float)raw.acc[2] * ACC_G_PER_LSB };
      float gyr_dps_now[3] = { gyr[0] / DEG2RAD, gyr[1] / DEG2RAD, gyr[2] / DEG2RAD };
      acc_calibration_sample_task(millis(), raw_acc_g, gyr_dps_now); }
#endif

    /* Configurable gyro low-pass reduces white noise without changing the
     * 2 kHz fusion cadence. The first sample seeds the filter. */
    if(!gyr_lpf_init)
    {
      for(i = 0; i < 3U; i++) gyr_lpf[i] = gyr[i];
      gyr_lpf_init = 1U;
    }
    else
    {
      for(i = 0; i < 3U; i++)
      {
        gyr_lpf[i] += gyr_lpf_alpha * (gyr[i] - gyr_lpf[i]);
      }
    }

    t0 = dwt_cycles();
    vqf_update(gyr_lpf, acc);

    /* Fast-start background bias refinement. VQF is already running using the
     * persisted bias; while the unit remains still, average the live residual
     * and move the estimate gradually instead of causing an attitude step. */
    if(quick_bias_active != 0U)
    {
      const float residual[3] = {
        gyr[0] - quick_bias[0], gyr[1] - quick_bias[1], gyr[2] - quick_bias[2]
      };
      const float residual_norm = sqrtf(residual[0] * residual[0] +
                                        residual[1] * residual[1] +
                                        residual[2] * residual[2]);
      const float acc_norm = sqrtf(acc[0] * acc[0] + acc[1] * acc[1] + acc[2] * acc[2]);
      const uint32_t now_ms = millis();
      const uint32_t elapsed_ms = (quick_save_elapsed_ms == 0U) ? 0U :
                                   (uint32_t)(now_ms - quick_save_elapsed_ms);
      if((residual_norm <= (CAL_GYR_REST_DPS * DEG2RAD)) &&
         (fabsf(acc_norm - G_TO_MS2) <= CAL_ACC_REST_MS2))
      {
        quick_rest_ms += elapsed_ms;
        quick_bias_sum[0] += gyr[0];
        quick_bias_sum[1] += gyr[1];
        quick_bias_sum[2] += gyr[2];
        quick_samples++;
        if(quick_rest_ms >= APP_GYR_FAST_START_REST_MS && quick_samples != 0U)
        {
          const float measured[3] = {
            quick_bias_sum[0] / (float)quick_samples,
            quick_bias_sum[1] / (float)quick_samples,
            quick_bias_sum[2] / (float)quick_samples
          };
          const float alpha = APP_GYR_FAST_START_BLEND;
          quick_bias[0] += alpha * (measured[0] - quick_bias[0]);
          quick_bias[1] += alpha * (measured[1] - quick_bias[1]);
          quick_bias[2] += alpha * (measured[2] - quick_bias[2]);
          vqf_set_gyr_bias(quick_bias);
          if((quick_rest_ms >= APP_GYR_FAST_START_SAVE_MS) && (quick_bias_saved == 0U))
          {
            const float delta = fabsf(quick_bias[0] - quick_bias_initial[0]) +
                                fabsf(quick_bias[1] - quick_bias_initial[1]) +
                                fabsf(quick_bias[2] - quick_bias_initial[2]);
            if((delta > (APP_GYR_FAST_START_SAVE_DELTA_DPS * DEG2RAD)) ||
               (fabsf(temp_c - quick_bias_temp_c) > APP_GYR_FAST_START_SAVE_TEMP_C))
            {
              if(app_save_gyro_bias(quick_bias, temp_c) != 0)
                bias_history_write_error = 1U;
              else
                quick_bias_saved = 1U;
            }
            else
            {
              quick_bias_saved = 1U;
            }
          }
        }
      }
      else
      {
        quick_rest_ms = 0U;
        quick_samples = 0U;
        quick_bias_sum[0] = quick_bias_sum[1] = quick_bias_sum[2] = 0.0f;
      }
      quick_save_elapsed_ms = now_ms;
    }
    /* Non-blocking 50 Hz magnetometer scheduler: never wait 5 ms inside
     * the 2 kHz IMU/VQF path. Only the short I2C trigger/read transactions
     * occupy the loop. */
    if(mag_ok)
    {
      if(!mag_pending && ((fusion_n % MAG_PERIOD_N) == 0U))
      {
        mag_err = ist8310_start_measurement();
        if(mag_err == 0)
        {
          mag_pending = 1U;
          mag_start_n = fusion_n;
        }
      }
      else if(mag_pending && ist8310_data_ready())
      {
        int16_t mag_raw[3];
        mag_err = ist8310_read_ready(mag_raw);
        mag_pending = 0U;
        if(mag_err == 0)
        {
          mag_raw_live.seq++;
          __DMB();
          mag_raw_live.millis = millis();
          mag_raw_live.x = mag_raw[0];
          mag_raw_live.y = mag_raw[1];
          mag_raw_live.z = mag_raw[2];
          mag_raw_live.sample_n++;
          __DMB();
          mag_raw_live.seq++;
          /* Calibrate in IST8310 axes first, then map once into LSM6DSV axes.
           * Raw telemetry above stays in original IST8310 register axes. */
          {
            float uncal_centered[3];
            float calibrated_mag[3];
            unsigned row, col;
            for(row = 0; row < 3U; ++row)
              uncal_centered[row] = (float)mag_raw[row] * MAG_UT_PER_LSB - mag_cal_offset[row];
            for(row = 0; row < 3U; ++row)
            {
              calibrated_mag[row] = 0.0f;
              for(col = 0; col < 3U; ++col)
                calibrated_mag[row] += mag_cal_matrix[row][col] * uncal_centered[col];
            }
            mag_map_to_imu(calibrated_mag, mag);
          }
          mag_read_n++;
          /* Official Full VQF's disturbance rejection uses atan2/asin and a
           * second-order filter. Run that at 10 Hz so it cannot steal a 2 kHz
           * gyro sample; the latest 50 Hz field vector remains in telemetry. */
#if MAG_FUSION_ENABLE
          if(((mag_read_n - 1U) % MAG_VQF_DIV) == 0U)
          {
            if(vqf_update_mag(mag) == 0) mag_updates++;
          }
#endif
        }
      }
      else if(mag_pending && ((fusion_n - mag_start_n) > MAG_TIMEOUT_N))
      {
        mag_err = -4;
        mag_pending = 0U;
      }
    }
    vqf_us = (dwt_cycles() - t0) / (system_core_clock / 1000000U);
    fusion_n++;
    window_samples++;

    if((fusion_n % app_output_div) == 0U)
    {
      /* Odd/even sequence lock lets DAPLink read a coherent live snapshot
       * without halting the 2 kHz fusion loop. */
      vqf_live.seq++;
      __DMB();
      vqf_get_quat9d(q);
      vqf_get_euler_deg(&roll, &pitch, &yaw);

