Mathonix/AT32F423_LSM6DSV/src/app/main.c
      vqf_live.roll = roll;
      vqf_live.pitch = pitch;
      vqf_live.yaw = yaw;
      vqf_live.qw = q[0];
      vqf_live.qx = q[1];
      vqf_live.qy = q[2];
      vqf_live.qz = q[3];
      vqf_live.gx = (float)raw.gyr[0] * GYR_DPS_PER_LSB;
      vqf_live.gy = (float)raw.gyr[1] * GYR_DPS_PER_LSB;
      vqf_live.gz = (float)raw.gyr[2] * GYR_DPS_PER_LSB;
      vqf_live.ax = (float)raw.acc[0] * ACC_G_PER_LSB;
      vqf_live.ay = (float)raw.acc[1] * ACC_G_PER_LSB;
      vqf_live.az = (float)raw.acc[2] * ACC_G_PER_LSB;
      {
        float live_bias[3];
        vqf_get_gyr_bias(live_bias);
        vqf_live.bias_x = live_bias[0] / DEG2RAD;
        vqf_live.bias_y = live_bias[1] / DEG2RAD;
        vqf_live.bias_z = live_bias[2] / DEG2RAD;
      }
      /* gyr_lpf_z is the (temperature-compensated) signal actually supplied
       * to VQF. corrected_z is its residual after VQF's current bias estimate;
       * both fields are exposed in dps for direct drift diagnosis. */
      vqf_live.temperature_c = imu_temp_live.temperature_c;
      vqf_live.gyr_lpf_z = gyr_lpf[2] / DEG2RAD;
      vqf_live.corrected_z = vqf_live.gyr_lpf_z - vqf_live.bias_z;
      vqf_live.rest_time = vqf_get_rest_time();
      vqf_live.tau_acc = vqf_get_tau_acc();
      vqf_live.rest_detected = (uint32_t)vqf_get_rest_detected();
      vqf_live.mx = mag[0];
      vqf_live.my = mag[1];
      vqf_live.mz = mag[2];
      vqf_live.mag_norm = sqrtf(mag[0]*mag[0] + mag[1]*mag[1] + mag[2]*mag[2]);
      vqf_live.tau_mag = vqf_get_tau_mag();
      vqf_live.mag_err = mag_err;
      vqf_live.mag_updates = mag_updates;
      vqf_live.mag_ready = (uint32_t)vqf_get_mag_ready();
      vqf_live.mag_disturbed = (uint32_t)vqf_get_mag_dist_detected();
      vqf_live.vqf_us = vqf_us;
      vqf_live.fusion_n = fusion_n;
      vqf_live.skip_n = skip_n;
      vqf_live.millis = millis();
      __DMB();
      vqf_live.seq++;
      out_n++;

      if((fusion_n % DAP_OUTPUT_DIV) == 0U)
      {
        acc_cal_live.seq++;
        __DMB();
        acc_cal_live.millis = vqf_live.millis;
        for(i = 0U; i < 3U; ++i)
        {
          acc_cal_live.raw_g[i] = (float)raw.acc[i] * ACC_G_PER_LSB;
          acc_cal_live.corrected_g[i] = acc[i] / G_TO_MS2;
        }
        __DMB();
        acc_cal_live.seq++;
        vqf_tune_live.seq++;
        __DMB();
        vqf_tune_live.millis = vqf_live.millis;
        vqf_tune_live.fusion_hz = vqf_live.fusion_hz;
        vqf_tune_live.skip_n = vqf_live.skip_n;
        vqf_tune_live.rest_detected = vqf_live.rest_detected;
        vqf_tune_live.roll = vqf_live.roll;
        vqf_tune_live.pitch = vqf_live.pitch;
        vqf_tune_live.yaw = vqf_live.yaw;
        vqf_tune_live.gx = vqf_live.gx;
        vqf_tune_live.gy = vqf_live.gy;
        vqf_tune_live.gz = vqf_live.gz;
        vqf_tune_live.ax = vqf_live.ax;
        vqf_tune_live.ay = vqf_live.ay;
        vqf_tune_live.az = vqf_live.az;
        vqf_tune_live.bias_x = vqf_live.bias_x;
        vqf_tune_live.bias_y = vqf_live.bias_y;
        vqf_tune_live.bias_z = vqf_live.bias_z;
        vqf_tune_live.rest_time = vqf_live.rest_time;
        vqf_tune_live.tau_acc = vqf_live.tau_acc;
        vqf_tune_live.temperature_c = vqf_live.temperature_c;
        vqf_tune_live.gyr_lpf_z = vqf_live.gyr_lpf_z;
        vqf_tune_live.corrected_z = vqf_live.corrected_z;
        vqf_tune_live.mx = vqf_live.mx;
        vqf_tune_live.my = vqf_live.my;
        vqf_tune_live.mz = vqf_live.mz;
        vqf_tune_live.mag_norm = vqf_live.mag_norm;
        vqf_tune_live.tau_mag = vqf_live.tau_mag;
        vqf_tune_live.mag_err = vqf_live.mag_err;
        vqf_tune_live.mag_addr = vqf_live.mag_addr;
        vqf_tune_live.mag_updates = vqf_live.mag_updates;
        vqf_tune_live.mag_ready = vqf_live.mag_ready;
        vqf_tune_live.mag_disturbed = vqf_live.mag_disturbed;
        __DMB();
        vqf_tune_live.seq++;
        vqf_nine_live.seq++;
        __DMB();
        vqf_nine_live.snapshot = vqf_tune_live;
        {
          float diagnostic[8];
          unsigned j;
          vqf_get_nine_diagnostic(diagnostic);
          for(j = 0U; j < 8U; ++j) vqf_nine_live.diagnostic[j] = diagnostic[j];
        }
        __DMB();
        vqf_nine_live.seq++;
      }
      if(protocol_reset_pending == RESET_NONE)
        vofa_send_justfloat((float)vofa_late);
    }

service_tasks:
    usb_cdc_task();
    {
      uint8_t ch;
      uint16_t budget;
      static uint8_t uart_legacy_buf[4];
      static uint8_t uart_legacy_idx;
      static uint8_t usb_legacy_buf[4];
      static uint8_t usb_legacy_idx;
      budget = 128U;
      while(budget-- != 0U && uart_read_byte(&ch))
      {
        protocol_parser_feed_byte(&uart_protocol_parser, ch);
        legacy_command_feed(ch, uart_legacy_buf, &uart_legacy_idx);
      }
      budget = 64U;
      while(budget-- != 0U && usb_cdc_read_byte(&ch))
      {
        protocol_parser_feed_byte(&usb_protocol_parser, ch);
        legacy_command_feed(ch, usb_legacy_buf, &usb_legacy_idx);
      }
    }
    /* Do not reset until the ACK leaves both transports; cap the wait so an
     * unplugged/stalled host cannot prevent recovery indefinitely. */
    uart_tx_task();
    if(protocol_reset_pending != RESET_NONE &&
       ((uart_tx_idle() && usb_cdc_tx_idle()) ||
        (uint32_t)(millis() - reset_requested_ms) >= 100U))
      app_perform_reset(protocol_reset_pending);
    if(app_sample_rebase != 0U)
    {
      app_sample_rebase = 0U;
      last_sample_cy = dwt_cycles();
      skip_n += (app_flash_pause_us * APP_FUSION_HZ) / 1000000U;
    }

    {
      ws2812_mode_t led_mode = WS2812_MODE_6AXIS;
      /* A magnetometer sample must have reached VQF before advertising 9D.
       * Relative yaw is only an output reference and does not change this
       * nine-axis status indication. */
      if((mag_ok != 0U) && (vqf_get_mag_ready() != 0))
      {
        led_mode = WS2812_MODE_9AXIS;
      }
#if APP_ACC_CAL_ENABLE
      if(acc_cal_rt.active != 0U || acc_cal_status_live.status == ACC_CAL_STATUS_FAILED)
      {
        ws2812_acc_calibration_task(millis(), acc_cal_rt.face + 1U, acc_cal_rt.active, acc_cal_status_live.status == ACC_CAL_STATUS_FAILED);
      }
      else
#endif
      if(app_settings_mode != 0U)
      {
        /* Settings mode has priority over all status warnings and freezes
         * the LED brightness (no breathing). */
        ws2812_settings_task(millis(), led_mode);
      }
      else if((app_fusion_mode == FUSION_MODE_6AXIS) ||
              (mag_ok != 0U) || (APP_MAG_FUSION_ENABLE == 0U) ||
              (bias_fallback != 0U) || (bias_history_write_error != 0U) ||
              (app_settings_dirty != 0U))
      {
        ws2812_normal_task(millis(), led_mode,
                           bias_no_history,
                           (uint8_t)vqf_get_mag_dist_detected(),
                           app_settings_dirty,
                           bias_history_write_error);
      }
    }
#if APP_CAN_ENABLE
    /* CAN needs microsecond timing: the millisecond tick cannot schedule 1 kHz. */
    can_test_task(dwt_cycles() / (system_core_clock / 1000000U));
    {
      uint8_t cmd = can_test_get_cmd_flag();
      if(cmd & CAN_CMD_FLAG_REBOOT)
      {
        nvic_system_reset();
      }
      if(cmd & CAN_CMD_FLAG_ZERO_YAW)
      {
        can_test_clear_cmd_flag(CAN_CMD_FLAG_ZERO_YAW);
        app_zero_yaw(vofa_pose_live.yaw);
      }
      if(cmd & CAN_CMD_FLAG_RECAL)
      {
        can_test_clear_cmd_flag(CAN_CMD_FLAG_RECAL);
      }
    }
#endif

    if((millis() - last_ms) >= 1000U)
    {
      fusion_hz = window_samples;
      vqf_live.fusion_hz = fusion_hz;
      vqf_live.out_hz = out_n;
      vqf_live.clk_hz = system_core_clock;
      window_samples = 0;
      last_ms += 1000U;
      if(out_n >= 500U)
      {
        led_toggle();
      }
      out_n = 0;
    }
    continue;
recover_or_continue:
    if(err_streak >= ERR_STREAK_RECOVER)
    {
      (void)lsm6dsv_spi_recover();
      (void)lsm6dsv_init_2khz();
      live_whoami();
      err_streak = 0U;
    }
    goto service_tasks;
  }
  }
}
